<a href="https://colab.research.google.com/github/saima8/Data-Science-from-scratch/blob/main/EDA_assinment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Q1. Apply all type of EDA that had been gone throuhout the EDA class.

In [1]:
#importing all the libraries 
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv("/content/houses_to_rent.csv")

In [3]:
data

      Unnamed: 0  city  area  ...  property tax  fire insurance     total
0              0     1   240  ...       R$1,000           R$121   R$9,121
1              1     0    64  ...         R$122            R$11   R$1,493
2              2     1   443  ...       R$1,417            R$89  R$12,680
3              3     1    73  ...         R$150            R$16   R$2,116
4              4     1    19  ...          R$41            R$16   R$1,257
...          ...   ...   ...  ...           ...             ...       ...
6075        6075     1    50  ...           R$0            R$15   R$1,585
6076        6076     1    84  ...          R$63            R$37   R$3,768
6077        6077     0    48  ...          R$42            R$13   R$1,255
6078        6078     1   160  ...         R$250            R$53   R$3,803
6079        6079     1    60  ...           R$0            R$25   R$2,414

[6080 rows x 14 columns]

In [4]:
data.shape#for finding the shape of dataset

(6080, 14)

In [5]:
data.columns # all columns of dataset

Index(['Unnamed: 0', 'city', 'area', 'rooms', 'bathroom', 'parking spaces',
       'floor', 'animal', 'furniture', 'hoa', 'rent amount', 'property tax',
       'fire insurance', 'total'],
      dtype='object')

In [6]:
data.columns[[1,2]]# to see specific columns name

Index(['city', 'area'], dtype='object')

In [7]:
data.index# for finding total index number

RangeIndex(start=0, stop=6080, step=1)

In [8]:
data.values[[2,3]]# specific rows values finding

array([[2, 1, 443, 5, 5, 4, '3', 'acept', 'furnished', 'R$4,172',
        'R$7,000', 'R$1,417', 'R$89', 'R$12,680'],
       [3, 1, 73, 2, 2, 1, '12', 'acept', 'not furnished', 'R$700',
        'R$1,250', 'R$150', 'R$16', 'R$2,116']], dtype=object)

In [9]:
data.loc[[3,4]]# finding rows by firecting location

   Unnamed: 0  city  area  ...  property tax  fire insurance    total
3           3     1    73  ...         R$150            R$16  R$2,116
4           4     1    19  ...          R$41            R$16  R$1,257

[2 rows x 14 columns]

In [10]:
data.iloc[[1,-1]]# see first and last location

      Unnamed: 0  city  area  ...  property tax  fire insurance    total
1              1     0    64  ...         R$122            R$11  R$1,493
6079        6079     1    60  ...           R$0            R$25  R$2,414

[2 rows x 14 columns]

In [11]:
subset=data.iloc[:,[2,3,4]]#creating a subset of dataset by taking specifing columns

In [12]:
subset

      area  rooms  bathroom
0      240      3         3
1       64      2         1
2      443      5         5
3       73      2         2
4       19      1         1
...    ...    ...       ...
6075    50      2         1
6076    84      2         2
6077    48      1         1
6078   160      3         2
6079    60      2         1

[6080 rows x 3 columns]

In [14]:
#creating a group  of columns for visualize specific data
# data.loc[(data['area'] == 'Wales') & (data['vaccines'] == 'Oxford/AstraZeneca, Pfizer/BioNTech')]

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6080 entries, 0 to 6079
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      6080 non-null   int64
 1   city            6080 non-null   int64
 2   area            6080 non-null   int64
 3   rooms           6080 non-null   int64
 4   bathroom        6080 non-null   int64
 5   parking spaces  6080 non-null   int64
 6   floor           6080 non-null   object
 7   animal          6080 non-null   object
 8   furniture       6080 non-null   object
 9   hoa             6080 non-null   object
 10  rent amount     6080 non-null   object
 11  property tax    6080 non-null   object
 12  fire insurance  6080 non-null   object
 13  total           6080 non-null   object
dtypes: int64(6), object(8)
memory usage: 665.1+ KB

In [16]:
data.describe()

       Unnamed: 0         city  ...     bathroom  parking spaces
count  6080.00000  6080.000000  ...  6080.000000     6080.000000
mean   3039.50000     0.863322  ...     2.341612        1.756250
std    1755.28915     0.343535  ...     1.438860        1.611909
min       0.00000     0.000000  ...     1.000000        0.000000
25%    1519.75000     1.000000  ...     1.000000        1.000000
50%    3039.50000     1.000000  ...     2.000000        1.000000
75%    4559.25000     1.000000  ...     3.000000        2.000000
max    6079.00000     1.000000  ...    10.000000       12.000000

[8 rows x 6 columns]

In [17]:
data.isnull().sum().sum()

0

In [18]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import IsolationForest
from sklearn.metrics import mean_absolute_error

In [19]:
df=data.values
df

array([[0, 1, 240, ..., 'R$1,000', 'R$121', 'R$9,121'],
       [1, 0, 64, ..., 'R$122', 'R$11', 'R$1,493'],
       [2, 1, 443, ..., 'R$1,417', 'R$89', 'R$12,680'],
       ...,
       [6077, 0, 48, ..., 'R$42', 'R$13', 'R$1,255'],
       [6078, 1, 160, ..., 'R$250', 'R$53', 'R$3,803'],
       [6079, 1, 60, ..., 'R$0', 'R$25', 'R$2,414']], dtype=object)